//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/30   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
/**
 * <pre>
 * BL永続性関連クラス格納用のパッケージです。
 * frameworkのpersistenceパッケージとの違いは下記の通りです。
 *  ・frameworkのpersistenceパッケージはBL以外のプロジェクトも適用できる。
 *  ・本パッケージのクラスはBLプロジェクトに拡張の例外クラスです。
 * </pre>
 */
package jp.co.broadleaf.common.persistence;
