//****************************************************************************//
// システム                                    : 優良部品登録簡易システム
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号:            作成担当:tangyp
// 作成日:2017/02/17    修正内容:申請履歴一覧の起動方式のEnumファイル:新規作成
// ---------------------------------------------------------------------------//

package jp.co.broadleaf.breg.applyhistory.enums;

/**
 * 申請履歴一覧の起動方式
 */
public enum ApplyHistoryModeEnum {

  /**
   * 1:起動方式１
   */
  mode1(1, "起動方式１"),

  /**
   * 2:起動方式２
   */
  mode2(2, "起動方式２"),
  
  /**
   * 3:起動方式３
   */
  mode3(3, "起動方式３"),
  
  /**
   * 4:起動方式４
   */
  mode4(4, "起動方式４"),
  
  /**
   * 5:起動方式５
   */
  mode5(5, "起動方式５");

  /**
   * 起動方式の数値
   */
  private int value = 0;

  /**
   * コンストラクタ
   * 
   * @param value 起動方式の数値
   * @param name 起動方式の名称
   */
  ApplyHistoryModeEnum(int value, String name) {
    this.value = value;
  }

  /**
   * 起動方式の数値を取得する
   *
   * @return 起動方式の数値
   */
  public int getValue() {
    return this.value;
  }
}
