//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/30   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.framework.dao.criteria;

/**
 * 日付型フィルタ演算子の列挙型です
 */
public enum DateFilterOp {

  /**
   * 空
   */
  IsNull,

  /**
   * 非空
   */
  IsNotNull,

  /**
   * =
   */
  Equals,

  /**
   * &lt;&gt;
   */
  NotEquals,

  /**
   * &gt;
   */
  GreaterThan,

  /**
   * &gt;=
   */
  GreaterThanOrEquals,

  /**
   * &lt;
   */
  LessThan,

  /**
   * &lt;=
   */
  LessThanOrEquals
}
