//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/30   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.framework.dao.criteria;

/***
 * ソートビジタークラス
 */
public interface OrderVisitor {

  /***
   * 単項目ソートビジター
   * 
   * @param order 単項目ソート
   */
  void visitFieldOrder(FieldOrder order);

  /***
   * 複数項目ソートビジター
   * 
   * @param order 複数項目ソート
   */
  void visitMultiFieldOrder(MultiFieldOrder order);
}
