//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2016/06/15   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
/**
 * <pre>
 * BLプロジェクト用の共通クラス格納用のパッケージです。
 * frameworkパッケージとの違いは下記の通りです。
 *  ・frameworkパッケージはBL以外のプロジェクトも適用できる。
 *  ・本パッケージのクラスはBLプロジェクトに専用または拡張のクラスです。
 * </pre>
 */
package jp.co.broadleaf.common.impl;
