//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/24   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.common.property;

/**
 * <pre>
 * プロパティのデータ型の規範定義用クラスです。
 * </pre>
 */
public abstract class PropertyTypeSpecs {

  /**
   * 日付データ型プロパティ利用できるのフォーマット
   */
  public static final String[] VALID_DATE_FORMATS = new String[] { "yyyyMMdd" };
}
