//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/24   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.common.property;

/**
 * <pre>
 * Broadleafプロジェクト用プロパティリゾルバクラスです。
 * </pre>
 */
public interface PropertyResolver {

  /**
   * プロパティ値を取得する。
   * 
   * @param <T> プロパティのタイプ
   * @param key プロパティキー
   * @return プロパティ値
   */
  <T> T getProperty(PropertyKey<T> key);
}
