//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/30   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.framework.validation;

/**
 * <pre>
 * フィールド検証ルール
 * </pre>
 * 
 * @param <T> 検証ルール
 */
public interface FieldValidatorRule<T> {

  /**
   * ルールでフィールドを検証する
   * 
   * @param fieldName フィールドの名
   * @param fieldValue フィールドの値
   * @return マッチング結果
   */
  boolean match(String fieldName, T fieldValue);
}
