//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : chenlong
// 作 成 日       2017/02/08   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.breg.setlist.facade.dto;

import jp.co.broadleaf.breg.setlist.domain.model.SetMaster;

/**
 * セットマスタのDtoのクラス。
 */
public class SetMasterSearchDto extends SetMaster {
  /**  */
  private static final long serialVersionUID = 1L;
  
 
}
