//****************************************************************************//
// システム                                    :優良部品登録簡易システム
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                  作成担当 : 楊蕾蕾
// 作 成 日       2017/02/13   修正内容 : 申請 (新規品目):新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.breg.applynewcategory.enums;

/**
 * <pre>
 *  申請 (新規品目)のENUMS
 * </pre>
 */
public enum ApplyNewCategoryModeEnum {
  /**
   * 1:メニューから
   */
  mode1(1, "起動方式１"),

  /**
   * 2:申請履歴から(申請中 承認済)
   */
  mode2(2, "起動方式２"),
  
  /**
   * 3:申請履歴から (申請戻し)
   */
  mode3(3, "起動方式３"),
  
  /**
   * 4:申請再提出
   */
  mode4(4, "起動方式4");
  
  /**
   * 起動方式の数値
   */
  private int value = 0;

  /**
   * コンストラクタ
   * 
   * @param value 起動方式の数値
   * @param name 起動方式の名称
   */
  ApplyNewCategoryModeEnum(int value, String name) {
    this.value = value;
  }

  /**
   * 起動方式の数値を取得する
   *
   * @return 起動方式の数値
   */
  public int getValue() {
    return this.value;
  }
 
}
