//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/30   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.framework.exception;

/**
 * <pre>
 * 権限なし例外クラス、セキュリティベース例外の子例外。
 * </pre>
 */
public class NoPermissionException extends SecurityException {

  /** serialVersionUID */
  private static final long serialVersionUID = -8984334441152699827L;

  /**
   * コンストラクタ
   */
  public NoPermissionException() {
  }

}
