//****************************************************************************//
// システム                                    : 優良部品簡易登録システムBREG
// ---------------------------------------------------------------------------//
//                (c) Copyright 2017 Broadleaf Co.,Ltd.
//============================================================================//
// 履歴
// ---------------------------------------------------------------------------//
// 管理番号                                   作成担当 : LDNS技術共通チーム
// 作 成 日       2017/01/30   修正内容 : 新規作成
// ---------------------------------------------------------------------------//
package jp.co.broadleaf.framework.exception;

/**
 * セキュリティ関連例外の基底クラス。
 */
public abstract class SecurityException extends RuntimeException {

  /** serialVersionUID */
  private static final long serialVersionUID = -871501092104754180L;

  /**
   * コンストラクタ
   */
  public SecurityException() {
  }

}
